Tekla Open API Reference for Tekla Structures 2025
Picker.PickPoints Method
Overload List
Name | Description
PickPoints(StringList)
 Requests picks of points from the user. The sequence is terminated by the middle button pick. Returns the picked points in the view coordinates and the view in which the pick occurred.
PickPoints(Int32, StringList)
 Requests N picks of points from the user. Returns the picked points in the view coordinates and the view in which the pick occurred.
PickPoints(StringList, PointList, ViewBase)
 Requests picks of points from the user. The sequence is terminated by the middle button pick.
PickPoints(Int32, StringList, PointList, ViewBase)
 Requests N picks of points from the user.
Top
See Also
Reference
Picker Class
Tekla.Structures.Drawing.UI Namespace